#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ssm_parameter.infra_output: Reading...
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.assume_by_codedeploy: Reading...
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-6-task-execution-role]
data.aws_iam_policy_document.assume_by_codedeploy: Read complete after 0s [id=4250039221]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-6-task-role]
data.aws_ssm_parameter.infra_output: Read complete after 0s [id=/app-6/output]
aws_iam_policy.secrets_manager_read_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-6-task-execution-role-20241003153209502800000001]
aws_ecs_task_definition.web_app: Refreshing state... [id=app-6]
data.aws_iam_policy_document.codedeploy: Reading...
data.aws_iam_policy_document.codedeploy: Read complete after 0s [id=1211725747]
aws_iam_role_policy_attachment.attach_secrets_read_task_role: Refreshing state... [id=app-6-task-role-20241003153209524100000003]
aws_iam_role_policy_attachment.attach_secrets_read_task_execution_role: Refreshing state... [id=app-6-task-execution-role-20241003153209508300000002]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_ecs_task_definition.web_app must be replaced
-/+ resource "aws_ecs_task_definition" "web_app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:27" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "app-6" -> (known after apply)
      ~ revision                 = 27 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.codedeploy will be created
  + resource "aws_iam_role" "codedeploy" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-6-code-deploy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.codedeploy will be created
  + resource "aws_iam_role_policy" "codedeploy" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:UpdateServicePrimaryTaskSet",
                          + "ecs:DescribeServices",
                          + "ecs:DeleteTaskSet",
                          + "ecs:CreateTaskSet",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:us-east-2:743794601996:service/*"
                      + Sid      = "AllowLoadBalancingAndECSModifications"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:ModifyRule",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeListeners",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/*",
                          + "arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/*",
                          + "arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/*",
                        ]
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::*/*"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::743794601996:role/app-6-task-execution-role"
                      + Sid      = "AllowPassRole"
                    },
                  + {
                      + Action   = [
                          + "codedeploy:RegisterApplicationRevision",
                          + "codedeploy:GetDeploymentGroup",
                          + "codedeploy:GetDeploymentConfig",
                          + "codedeploy:GetDeployment",
                          + "codedeploy:CreateDeployment",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:codedeploy:us-east-2:743794601996:*"
                      + Sid      = "DeployService"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "app-6-code-deploy-role"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*